In [35]:
import pandas as pd

In [36]:
data = {
    'Empresa': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Nome': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Venda': [200, 120, 340, 124, 243, 350]
}

In [37]:
df = pd.DataFrame(data)
print(df)

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [38]:
group = df.groupby('Empresa') # nao acontece nada no print, mas criou o grupo
print(group)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000021C7F00C5C0>

In [39]:
group.sum() # agrupou e fez uma soma que nem a eq SUM() do excel

               Nome  Venda
Empresa
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [40]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [41]:
group.count() # quantas vezes aparece

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [42]:
group = df.groupby('Nome')
print(group)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000021C11F4DDC0>

In [43]:
group.sum()

        Empresa  Venda
Nome
Amy        MSFT    340
Carl         FB    243
Charlie    GOOG    120
Sam        GOOG    200
Sarah        FB    350
Vanessa    MSFT    124

In [44]:
group.sum().loc['Amy'] # interessante

Empresa    MSFT
Venda       340
Name: Amy, dtype: object